content-org/all-post.org
#+hugo_base_dir: ../

* 在 IIS 上跑 python script                       :python:windows_server:iis:
:PROPERTIES:
:EXPORT_FILE_NAME: how-to-run-python-on-iis
:EXPORT_DATE: <2017-07-11>
:END:

雖然早就知道 Unix-like 環境下出身的語言跟 windows 就是天生不合，在架設時應當避免使用 windows，不過人在江湖身不由己，如今要在 IIS 下跑 python，只是沒想到過程竟如此折騰。而網路上的關於這方面的資源也並不多，在這裡就當做做個筆記。

環境如下，需注意不同版本的 windows 跟不同版本的 iis 可能會有些許的不同，這也是異常困難的地方，因為網路上的教學都不一定適用當下的環境。
- windows server 2012 R2
- iis 8.5
- python 3.6

1. 首先要先確認環境中的 CGI 功能是否開啟。
2. 在伺服器管理員中， =管理 -> 新增角色及功能 -> 網頁伺服器(IIS) -> 網頁伺服器 -> 應用程式開發 -> CGI= ，看 CGI 使否已安裝，如果沒安裝則安裝。
3. 上官網下載 python，版本應該不會影響太多，不過這裡是用 3.6 版。
4. 安裝時建議放在方便的路徑，預設的路徑很長又放在不明顯的地方。
5. 可以在安裝時勾選選項讓安裝程式幫您將 python 加到環境變數中。
6. 開啟 IIS 管理器
7. 新增一個網站。
6. 很重要的是記得開啟 **網站目錄** 及 **python** 目錄的權限給 **IUSR** 或是您所指定的使用者。
7. IIS -> 處理常式對應 -> 右側新增指令碼對應
8. 路徑： =*.py= ，執行檔： =<python安裝路徑>/python.exe %s %s= ，名稱： =python= (或是隨意)
9. 用瀏覽器開啟 .py 檔案位置

** 常見問題
*** Unauthroized
請確認 **網站目錄** 及 **python** 目錄的權限。



